/**
 * Ručne kreslené mapy. Riadok = world y, stĺpec = world x.
 * `.` podlaha · `#` stena · `P` stĺp · `D` stôl · `@` spawn · medzera = prázdno
 */
export const PROCESSING_OFFICE: readonly string[] = [
  '########################',
  '#......................#',
  '#..P.....P......P....P.#',
  '#......................#',
  '#..DDD..DDD....DDD..DD.#',
  '#......................#',
  '#..DDD..DDD....DDD..DD.#',
  '#..........@...........#',
  '#..P.....P......P....P.#',
  '#......................#',
  '#####.......############',
  '    #.......#           ',
  '    #...P...#           ',
  '    #.......#           ',
  '    #########           ',
];
